In [1]:
import pandas as pd

data = [1, 2, 3, 4]
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
dic = {'100':'남', '101':'여', '102':'', '103':'남'}
gender = pd.Series(dic)
gender

100    남
101    여
102
103    남
dtype: object

In [8]:
name = pd.Series({'100':'이산하', '101':'강하늘', '102':'김산', '103':'안전해'})
name

100    이산하
101    강하늘
102     김산
103    안전해
dtype: object

In [10]:
member = {'성별':gender, '이름':name}
회원 = pd.DataFrame(member)
회원

    성별   이름
100  남  이산하
101  여  강하늘
102      김산
103  남  안전해

In [11]:
회원 = pd.DataFrame({
    '회원번호':['100', '101', '102', '103'],
    '성별':['남', '여', '', '남'],
    '이름':['이산하', '강하늘', '김산', '안전해']
})
회원

  회원번호 성별   이름
0  100  남  이산하
1  101  여  강하늘
2  102      김산
3  103  남  안전해

In [29]:
회원 = pd.DataFrame({
    '회원번호':['100', '101', '102', '103'],
    '성별':['남', '여', '', '남'],
    '이름':['이산하', '강하늘', '김산', '안전해']
})
회원 = 회원.set_index('회원번호')
회원

     성별   이름
회원번호
100   남  이산하
101   여  강하늘
102       김산
103   남  안전해

In [30]:
회원['이름']

회원번호
100    이산하
101    강하늘
102     김산
103    안전해
Name: 이름, dtype: object

In [31]:
회원['성별']

회원번호
100    남
101    여
102
103    남
Name: 성별, dtype: object

In [32]:
회원['성별'] == '여'

회원번호
100    False
101     True
102    False
103    False
Name: 성별, dtype: bool

In [17]:
회원[회원['성별'] == '여']

     성별   이름
회원번호
101   여  강하늘

In [33]:
회원[['이름', '성별']]

       이름 성별
회원번호
100   이산하  남
101   강하늘  여
102    김산
103   안전해  남

## 값 변경하기 - loc와 iloc
### loc - location(위치), iloc - integer location(정수 위치)

In [34]:
회원.loc['102']['이름'] = '송중기'
회원

     성별   이름
회원번호
100   남  이산하
101   여  강하늘
102      송중기
103   남  안전해

In [35]:
회원.iloc[2][0] = '남'
회원

     성별   이름
회원번호
100   남  이산하
101   여  강하늘
102   남  송중기
103   남  안전해

## CSV 파일로 저장하기

In [36]:
회원.to_csv("회원명부.csv")